# ColorFillCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillLegend..::..ColorFillCategoryId Property
ColorFillLegend Class See Also
---
Returns the id of color fill category that this legend is created for.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId ColorFillCategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ColorFillCategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ColorFillCategoryId {
	ElementId^ get ();
}
```

# See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace